<script setup lang="ts">
import Divider from 'primevue/divider';


</script>

<template>
    <div>
        <div class="card">
            <div class="flex">
                <div>Content 1</div>
                <Divider layout="vertical" />
                <div>Content 2</div>
                <Divider layout="vertical" />
                <div>Content 3</div>
            </div>
        </div>

        <div class="card">
            <h5>Vertical</h5>
            <div class="flex">
                <p>患者の世話をすること、医師に従うことは重要ですが、それは大きな痛みと苦しみの時です。 細部に至るまで、何らかの利益が得られない限り、誰もどんな種類の仕事も実践すべきではありません。
                    叱責の痛みに腹を立てないでください、彼が痛みから髪になりたいと思う喜びで、彼を痛みから逃げさせてください。
                    欲望に目がくらんでいない限り、彼らは出てこない；義務を放棄し、心を和らげる、それは労苦である。 </p>

                <Divider layout="vertical" />

                <p>しかし、快楽を非難し、苦痛を称賛する人々の生まれつきの過ちがどこから来ているのかを理解していただくために、私は問題全体を明らかにし、真実の発見者であり、いわば世界の設計者である彼が語ったことそのものを説明します。幸せな人生。
                    なぜなら、快楽が快楽であるという理由で軽蔑したり、嫌ったり、快楽から逃げたりする人は誰もいないからです。 彼はそれを手に入れたいと思っていますが、それは決して彼の種類ではないからです. </p>

                <Divider layout="vertical" />

                <p>しかし、実際、私たちは非難し、ただの憎しみをもって、現在の喜びのお世辞によって軟化し、腐敗し、彼らが経験しようとしている痛みやトラブルに対する欲望によって目がくらんでいて、それらに提供しない人々を非難し、憎しみを持って連れてきます。
                    実際、これらのことを区別するのは簡単で便利です。 私たちの自由な時間、自由に選択できるとき、私たちを妨げるものは何もありません。 </p>
            </div>
        </div>
    </div>
</template>